Repository: DiagNet/DiagNet
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: de

source: No testcases found
de: Keine Testfälle gefunden

source: Documentation Not Found
de: Dokumentation nicht gefunden

source: No documentation is available for this test class at the moment.
de: Für diese Testklasse ist derzeit keine Dokumentation verfügbar.

source: Please select another test class or ensure that the class has an associated docstring.
de: Bitte wählen Sie eine andere Testklasse oder stellen Sie sicher, dass die Klasse über einen zugehörigen Docstring verfügt.

source: Tip: Docstrings are required for proper documentation display.
de: Tipp: Für die korrekte Anzeige der Dokumentation sind Docstrings erforderlich.

source: Select a test class to view its documentation.
de: Wählen Sie eine Testklasse aus, um deren Dokumentation anzuzeigen.

source: Please Enter a valid testcase name
de: Bitte geben Sie einen gültigen Namen für den Testfall ein

source: TestCase created successfully!
de: Testfall erfolgreich erstellt!

source: ERROR
de: FEHLER

source: Close
de: Schließen

source: Parameters can only be defined as a map like structure: Consider changing the test definition
de: Parameter können nur als Map-ähnliche Struktur definiert werden: Erwägen Sie eine Änderung der Testdefinition

source: No name found for given parameter: Consider adding the 'name' field in the test definition
de: Kein Name für den angegebenen Parameter gefunden: Erwägen Sie das Hinzufügen des Feldes 'name' in der Testdefinition

source: Mutually-Exclusive-Binding parameter not found as an actual Parameter
de: Parameter für gegenseitigen Ausschluss (Mutually-Exclusive-Binding) wurde nicht als tatsächlicher Parameter gefunden

source: Given parameters have to be contained in a list: Consider adding a valid test definition
de: Die angegebenen Parameter müssen in einer Liste enthalten sein: Erwägen Sie das Hinzufügen einer gültigen Testdefinition

source: Test-Class needs to contain at least 1 parameter
de: Die Testklasse muss mindestens einen Parameter enthalten

source: A Cisco interface identifier
de: Eine Cisco-Schnittstellenkennung

source: Device
de: Gerät

source: An IPv4 address
de: Eine IPv4-Adresse

source: An IPv4 network prefix in CIDR notation
de: Ein IPv4-Netzwerkpräfix in CIDR-Notation

source: An IPv6 address
de: Eine IPv6-Adresse

source: An IPv6 network prefix in CIDR notation
de: Ein IPv6-Netzwerkpräfix in CIDR-Notation

source: A whole number (0 or positive integer, e.g., 0, 1, 42)
de: Eine ganze Zahl (0 oder positive Ganzzahl, z. B. 0, 1, 42)

source: Number
de: Zahl

source: Choice Field
de: Auswahlfeld

source: Pick from a set of predefined choices for this parameter
de: Wählen Sie aus einer Reihe vordefinierter Optionen für diesen Parameter

source: maximum length reached
de: Maximale Länge erreicht

source: minimum length for this list is
de: Die Mindestlänge für diese Liste beträgt

source: List
de: Liste

source: A list of entries, each defining its child parameters
de: Eine Liste von Einträgen, von denen jeder seine untergeordneten Parameter definiert
